from pathlib import Path

import numpy as np
import taichi as ti

# Инициализация ядра taichi
data_type = ti.f64
ti.init(arch=ti.cpu, default_fp=data_type)
DEBUGGING = False

# Перевод единиц измерения
day_to_sec = 86400.0
bar_to_pa = 1e5
darcy_to_m2 = 9.869233e-13
cpoise_to_Pas = 1e-3

# Пути проекта
outputs_path = Path.cwd() / 'outputs'
results_path = outputs_path / 'results'
logs_path = outputs_path /  '.log'
js_path = Path.cwd() / 'paraphin' / 'utils' / 'plotly_script.js'

# Параметры сетки
Nx, Ny = 50, 50  # Число узлов сетки по x и y
X_min, X_max = 0., 250.    # Длина пласта, [м]
Y_min, Y_max = 0., 250.    # Ширина пласта, [м]
hx = (X_max - X_min) / Nx
hy = (Y_max - Y_min) / Ny
h = 1.0  # Толщина пласта, [м]
area = hx * hy
volume = area * h

# Параметры времени задачи
Time_end = day_to_sec * 365
dt = day_to_sec / 2 # шаг дискретизации по времени

# Параметры ОФП
S_min = 0.2
S_max = 0.7

# Параметры флюидов
Tm   = 55.0    # температура кристаллизации парафина, [C]
ro_w = 1000.0  # плотность воды, [кг/м^3]
ro_o = 860.0   # плотность нефти, [кг/м^3]
ro_p = 900.0   # плотность парафина, [кг/м^3]
ro_f = 2500.0  # плотность пласта, [кг/м^3]
mu_w = 1.0 * cpoise_to_Pas  # Вязкость воды, [Па*с]
mu_o = 5.0 * cpoise_to_Pas  # Вязкость нефти, [Па*с]
c_w = 4200  # Теплоемкость воды, [Дж*кг/C]
c_o = 2000  # Теплоемкость нефти, [Дж*кг/C]
c_p = 2200  # Теплоемкость парафина, [Дж*кг/C]
c_f = 850  # Теплоемкость пласта, [Дж*кг/C]
K_p  = 0.2     # Теплопроводность парафина, Вт/(м·С)
K_w  = 0.6     # Теплопроводность воды, Вт/(м·С)
K_o  = 0.12    # Теплопроводность нефти, Вт/(м·С)
K_f  = 2.0     # Теплопроводность пласта, Вт/(м·С)

# Данные моделирования кольматации\суффозии
Diff  = 2e-16  # Коэффициент диффузионного осаждения частиц, [м^2/с]
D     = 4e-6   # Размер частицы, [м]
betta = 0.01   # Доля блокируемых каналов, [-]
gamma = 0.4    # Отношение радиуса горла к радиусу канала, [-]
Lk    = 3e-5   # Длина капилляра, [м]
eta   = 1.0    # Коэффициент извилистости, [-]
Cf    = 3.e-2  # Коэффициент сопротивления частицы в нефти, [-]
Delta = 0.005  # Кинетическая константа суффозии, [1/м]
R     = 8.31446261815324  # газовая постоянная [J⋅K^−1⋅mol^−1]

# Параметры скважин
rw = 0.1             # радиус скважин, [м]
Pw = 150 * bar_to_pa  # давление на нагнетательной скважине, [Па]
Po = 50 * bar_to_pa  # давление на добывающей скважине, [Па]
Twater = 20          # температура нагнетаемой воды, [С]
_re = 0.14 * np.sqrt(hx * hx + hy * hy)  # Радиус контура питания скважины, [м]
conductivity_well = 2.0 * np.pi * h / np.log(_re / rw) * 0.25  # тк участвует только 0.25 дебита

# Данные инициализации
init_p   = 10 * bar_to_pa  # [Па]
init_S   = S_min
init_Wo  = 1.0
init_Wp  = 0.0
init_Wps = 0.0
init_k   = 0.2 * darcy_to_m2  # [м^2]
init_m   = 0.2
init_T   = 40  # [C]
init_qp  = 0.0
init_h_sloy = 0.0

if data_type == ti.f64:
    np_dtype = np.float64
else:
    np_dtype = np.float32
r = np.array([0.0, 0.000001, 0.000002, 0.000003, 0.000004, 0.000005, 0.000006, 0.000007, 0.000008,
              0.000009, 0.00001, 0.000011, 0.000012, 0.000013, 0.000014, 0.000015, 0.000016, 0.000017,
              0.000018, 0.000019, 0.00002, 0.000021, 0.000022, 0.000023, 0.000024, 0.000025], dtype=np_dtype)

fi_0 = np.array([0.0, 0.013, 0.023, 0.031, 0.035, 0.034, 0.027, 0.021, 0.016, 0.018, 0.025, 0.032, 0.041,
                 0.052, 0.061, 0.073, 0.082, 0.086, 0.081, 0.07, 0.059, 0.048, 0.035, 0.024, 0.013, 0], dtype=np_dtype)
Nr: int = len(r)

# Проверка числа Куранта
_u_aver = init_k / mu_o * Pw * 0.05
Courant_num = _u_aver * dt / _re
if Courant_num > 0.8:
    dt = _re / _u_aver
    dt = round(dt / day_to_sec, 3) * day_to_sec
    print(f'Не выполнено условие Куранта!! Новый шаг по времени {dt / day_to_sec} сут.')
else:
    dt /= (Courant_num / 0.8)
    dt = round(dt / day_to_sec, 3) * day_to_sec
    print(f'Новый шаг по времени увеличен до значения {dt / day_to_sec} сут.')

sol_time_step = dt * 10 # шаг по времени для сохранения результатов
