from pathlib import Path

import numpy as np
import taichi as ti

data_type = ti.f64
ti.init(arch=ti.cpu, default_fp=data_type)

outputs_path = Path.cwd() / 'outputs'
outputs_path.mkdir(exist_ok=True)
results_path = outputs_path / 'data.pkl'
logs_path = outputs_path /  'app.log'
js_path = Path.cwd() / 'paraphin' / 'utils' / 'plotly_script.js'

# Параметры сетки
Nx, Ny = 32, 32  # Число узлов сетки по x и y
X_min, X_max = 0., 300.
Y_min, Y_max = 0., 300.
hx = (X_max - X_min) / Nx
hy = (Y_max - Y_min) / Ny
area = hx * hy
volume = area * 1.0

# Параметры решения
Time_end = 86400 * 365  # год
dt = 86400  # шаг дискретизации по времени
sol_time_step = 86400  # шаг по времени для сохранения результатов

# Физические параметры задачи
S_min = 0.18
S_max = 0.7

Tm = 55  # температура кристаллизации парафина, [C]
ro_w = 1000  # плотность воды, [кг/м^3]
ro_o = 860  # плотность нефти, [кг/м^3]
ro_p = 900  # плотность парафина, [кг/м^3]
ro_f = 2500  # плотность пласта, [кг/м^3]
K_p = 0.2  # Теплопроводность парафина, Вт/(м·К)
K_w = 0.6  # Теплопроводность воды, Вт/(м·К)
K_o = 0.12  # Теплопроводность нефти, Вт/(м·К)
K_f = 2  # Теплопроводность пласта, Вт/(м·К)

# данные моделирования кольматации\суффозии
Diff = 2e-16  # Коэффициент диффузионного осаждения частиц, [м^2/c]
D = 4e-6  # Размер частицы, [м]
betta = 0.01  # Доля блокируемых каналов, [-]
gamma = 0.4  # Отношение радиуса горла к радиусу канала, [-]
Lk =  3e-5 # Длина капилляра, [м]
eta = 1.0  # Коэффициент извилистости, [-]
Cf = 3.e-2  # Коэффициент сопротивления частицы в нефти, [-]
Delta = 0.005  # Кинетическая константа суффозии, [1/м]
R = 8.31446261815324  # газовая постоянная [J⋅K^−1⋅mol^−1]

# учет скважин
rw = 0.1  # радиус скважин, [м]
Pw = 15 * 1e5  # давление на нагнетательной скважине, [Па]
Po = 50 * 1e5 # давление на добывающей скважине, [Па]
Twater = 10  # температура нагнетаемой воды, [С]
# TODO добавить множитель 0.25 для скважин

# данные инициализации
init_p = 1e6  # [Па]
init_S = 0.0
init_Wo = 0.95
init_Wp = 0.05
init_Wps = 0.0
init_k = 3e-13  # [м^2]
init_m = 0.2
init_T = 70  # [C]
init_qp = 0.0
init_h_sloy = 0.0
r = np.array([0, 0.000001, 0.000002, 0.000003, 0.000004, 0.000005, 0.000006, 0.000007, 0.000008,
              0.000009, 0.00001, 0.000011, 0.000012, 0.000013, 0.000014, 0.000015, 0.000016, 0.000017,
              0.000018, 0.000019, 0.00002, 0.000021, 0.000022, 0.000023, 0.000024, 0.000025], dtype=np.float64)

fi_0 = np.array([0, 0.013, 0.023, 0.031, 0.035, 0.034, 0.027, 0.021, 0.016, 0.018, 0.025, 0.032, 0.041,
                 0.052, 0.061, 0.073, 0.082, 0.086, 0.081, 0.07, 0.059, 0.048, 0.035, 0.024, 0.013, 0], dtype=np.float64)
Nr: int = len(r)
